{
	"menu": {
		"colums": ["id", "menuName", "linkPage", "user", "admin", "menuDescription", "cellija", "menuMeta", "content_body", "image"],
		"data": [{
			"id": 5,
			"menuName": "Gallery",
			"linkPage": "gallery",
			"user": "Y",
			"admin": "N",
			"menuDescription": "Photo Gallery",
			"cellija": "",
			"menuMeta": "",
			"content_body": "This is Photo Gallery CONTENT_BODY field and will show up as content on Gallery page if configured to appear. Originally idea is to display category short description since is part of navigation - menu. ",
			"image": ""
		}, {
			"id": 1,
			"menuName": "Home",
			"linkPage": "",
			"user": "Y",
			"admin": "N",
			"menuDescription": "Welcome",
			"cellija": "",
			"menuMeta": "Home page",
			"content_body": "<p>This is a home page just courious where will it appear ?<\/p>",
			"image": ""
		}, {
			"id": 3,
			"menuName": "Videos",
			"linkPage": "video",
			"user": "Y",
			"admin": "N",
			"menuDescription": "Videos",
			"cellija": "",
			"menuMeta": "",
			"content_body": "<p>This is interesting... what will happen?<\/p>",
			"image": ""
		}, {
			"id": 37,
			"menuName": "Feedback",
			"linkPage": "guestbook",
			"user": "Y",
			"admin": "Y",
			"menuDescription": "Comments",
			"cellija": "",
			"menuMeta": "",
			"content_body": "",
			"image": ""
		}, {
			"id": 48,
			"menuName": "About",
			"linkPage": "about",
			"user": "Y",
			"admin": "N",
			"menuDescription": "About me",
			"cellija": "sadrzaj",
			"menuMeta": "Portfolio, Boban Stefanovic,Boban Stefanovich, Chicago web developer, Chicago based freelance web developer, php,  User Interface,User Experience designer, Drupal, Wordpress, Nuke, Fatwire, Oracle WebCenter,  front end back end developer,Design Engineer,JavaScript, Prototype plugins,jQuery plugins, responsive design, responsive layouts, CSS, CSS3 , HTML5, mobile application,ajax ",
			"content_body": "<p>Hi There!<\/p>\r\n\r\n<p>I am Boban Stefanovich a Chicago based freelance, web developer, User Interface developer and User Experience spcialist,&nbsp; PHP developer and web designer. Too much I know... My recruiters use to say &quot;Boban you put almost anything we could find on web in your portfolio&quot;. Yes I been working so hard in last ten years and even today my list of skills is growing , projects pushing each other at the bottom of the list... I love working with small, excited, focused companies with big ideas.<\/p>\r\n\r\n<p><br \/>\r\nMy significant set of skills produced a huge experience in different areas of web development in more than last 10 years. There is no project manager who was not satisfied with my work, precision and reliability at least they did not tell me yet :) . I work with clients remotely all over the US (and rest of the world as well), so don&#39;t hesitate if you&#39;re worried about time zones. I&#39;m pretty crazy about the importance of effective communication and easy to work with no matter where you&#39;re located. I love JavaScript (I prefer Prototype but jQuery works for me as well) I love writing new plugins new modules, and taking UI simplicity on the next level. Huge experience in Content Management Systems including Drupal, Wordpress, Nuke, Fatwire (Today&#39;s Oracle Web Center&nbsp; Sites)<br \/>\r\n<br \/>\r\nI am founder of CMS Boban (content management system this website is made from). CMS Boban is written from scratch to the last detail by myself. That explains my experience and amount of hours built into &quot;my affection&quot;, skills and personal satisfaction.<br \/>\r\n<br \/>\r\nThose who know me well say that I&#39;m passionate about simplicity, ease of use, aesthetic beauty who is trying to improve the lives of others through great design and simple functionality. Planning the future of web with imagination or wisdom using current hi-web-technologies and tools to improve User Experience the best as I can. If your interest and passions align with mine please do get in touch, I&#39;d love to hear what you&#39;re working on.<\/p>\r\n\r\n<p>Boban Stefanovich<\/p>\r\n\r\n<p>UI Tech Lead&nbsp; @ Element Solutions 2015<\/p>\r\n",
			"image": "back7.jpg"
		}, {
			"id": 47,
			"menuName": "CMS",
			"linkPage": "CMS",
			"user": "Y",
			"admin": "N",
			"menuDescription": "Boban CMS",
			"cellija": "sadrzaj",
			"menuMeta": "StefaDesign CMS, scalable Content Manager System,scalable CMS, CMS for small businesses,",
			"content_body": "<div class=\"intro\">There are days when we all have difficulties to find correspondent technology for our product or needs. Just keep in mind that technology we are looking for is so close to us that we just cannot see it. So take a deep breath, step away and you will see it just In Front of Your Nose...<\/div>\r\n<h2>Simple to build, simple to use!<\/h2>\r\n<p>Boban SMC is very flexible and scalable  Content Manager System (CMS),  created to accommodate and display functionality  for small businesses  and portal version of category oriented articles.  What makes Boban SMC  different, you might see in few  features and internal  organization of content. Take a 'walk through' &nbsp;and discover if simplicity works for you too.<\/p>",
			"image": "back8.jpg"
		}, {
			"id": 49,
			"menuName": "Blog",
			"linkPage": "Blog",
			"user": "Y",
			"admin": "N",
			"menuDescription": "Internet cafe",
			"cellija": "sadrzaj",
			"menuMeta": "Blog Boban Stefanovich, Stefanovic web developer, UI developer, Web Designer, Chicago , Illinois",
			"content_body": "<p>I guess you might find some of interesting thoughts in here or some help you needed for&nbsp; your daily work. <\/p>\r\n<p>~Boban<\/p>",
			"image": "back9.jpg"
		}, {
			"id": 52,
			"menuName": "calendar",
			"linkPage": "",
			"user": "Y",
			"admin": "N",
			"menuDescription": "Calendar",
			"cellija": "",
			"menuMeta": "Scheduling appointments or calls using a chatbot. ",
			"content_body": "Scheduling appointments or calls using a chatbot. ",
			"image": ""
		}, {
			"id": 53,
			"menuName": "contact",
			"linkPage": "Contact",
			"user": "Y",
			"admin": "N",
			"menuDescription": "Contact Us component",
			"cellija": "",
			"menuMeta": "Contact Us Form",
			"content_body": "",
			"image": ""
		}]
	},
	"content": {
		"colums": ["id", "naslov", "sadrzaj", "link", "slika", "date", "home", "promo", "eventDate", "description"],
		"data": [{
			"id": 37,
			"naslov": "Contact Me",
			"sadrzaj": "<p>If you are interested in any kind of business relation, and you would like to contact me,&nbsp; please feel free to contact me and I will get back to you a soon as I can.&nbsp; To contact me you can use two different methods. Sending an email at boban.stefanovic@gmail.com  or clicking on \"Question Mark\" icon on the bottom and schedule call or Appointment using chatbot. <!-- or using form (<a href=\"index.php?form=contactUs\"> click here<\/a> ) --> . Once I get your email we can exchange phone numbers , IM, or whatever works the best for you.<\/p>\r\n",
			"link": "About",
			"slika": "back14.jpg",
			"date": "2012-02-10 20:38:31",
			"home": "Y",
			"promo": 0,
			"eventDate": "2019-08-14 23:00:00",
			"description": ""
		}, {
			"id": 45,
			"naslov": "Highlight area of experience ",
			"sadrzaj": "<p>Boban Stefanovich (I) works as a professional front to end developer for more than 10 years. I&nbsp; love JSON, JavaScript, Ajax, Across Domain functionality and other challenges with highlighted area of wisdom and compatibility.&nbsp; Significant level of skills and decent amount of experience in different areas of web development helped me to produce dozens of websites. In just a 5 years working as an employee of Element115,&nbsp; he gave a significant tone and valuable ideas to his work . Most of&nbsp; our&nbsp; clients were from Health Care Industry, which makes him understand perfectly Health Industry and UI required for the best user experience. &nbsp;<\/p>\r\n<p>Prototype has been replaced with jQuery (against my will) but today&nbsp; I&nbsp;prefer to write plugins rather than using some&nbsp; buggy and  non-flexible jQuery plugins. Of course nothing stops me so not to use  plugins as well&nbsp; if same are&nbsp; required. I prefer not to use frameworks but  if required for easier production I am totally supportive and ready for it. Building  user friendly interfaces, adding javascript as general user experience  and even totally new functionality is more than desire for me. If you just give me a  challenge I will respond with quality, quick solution and fast  implementation.&nbsp; UI Interface developer, backend developer , front end developer... name it as you wish but I do that&nbsp; thing ;)<\/p>\r\n<p>Currently, Boban Stefanovich&nbsp; is located in Chicago Illinois - US.<\/p>",
			"link": "About",
			"slika": "back9.jpg",
			"date": "2012-02-11 01:05:09",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "short description about Boban Stefanovic, his work and projects."
		}, {
			"id": 60,
			"naslov": "Welcome",
			"sadrzaj": "<p> <b>Boban<\/b> is a talented UI\/UX developer with a passion for project management and team collaboration. Hi is very organized and detail-oriented and has over 15 years of experience in web applications, HTML\/CSS development, CMS development (has one built of his own) and project planning and execution. He is always interested in the latest technologies, chatbots and AI. <\/p>\r\n\r\n<p>UX\/UI design specialist, full stack developer, MobileApp\/WebApp\/CMS with more than 15 years of experience over all. Boban Stefanovic Stefa  have dozens of successful design projects for small agencies and huge international corporations. He always helps  clients to properly allocate time and budgets and make smart investments cutting off unnecessary features, that require investments but are rarely used. Boban helps design and develop products from ground up keeping in mind the final business goal  and  branding success. <\/p>\r\n\r\n<img width=\"320px\" class=\"image-in-text\" src=\"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/f\/fa\/US-IL-Chicago-CA10.svg\/500px-US-IL-Chicago-CA10.svg.png\" \/> \r\n\r\n<p>Boban UI\/UX work has special focus on recognizing how to prevent user errors and reduce interstitial anxiety. Boban Stefanovic Stefa  prefer to guide user, to build forgiving code to avoid errors and anxiety, involving maximum human computer interaction layer of an app to improve UI, focusing on beauty , ease of use and efficiency. Additionally to get the best of UX , in his work he does research of user behavior to change an app design focusing on improving user attitude and usability. <\/p>\r\n\r\n<p>We all do the best do my best to meet our clients' expectations and deadlines. Boban does it while focusing on user-centric design philosophy, paying maximal attention on UX.<\/p>\r\n\r\n \r\n<h3>Boban Stefanovic Stefa - Norwood Park, Chicago IL <\/h3>\r\n\r\n<p>Norwood Park is one of the 77 Chicago community areas. It encompasses the smaller neighborhoods of Big Oaks, Norwood Park East, Norwood Park West, Old Norwood Park, Oriole Park, and Union Ridge.<\/p>\r\n",
			"link": "About",
			"slika": "",
			"date": "2012-09-27 08:33:02",
			"home": "Y",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": ""
		}, {
			"id": 48,
			"naslov": "About Boban Stefanovic ",
			"sadrzaj": "<p>Boban Stefanovich (origin in Serbian:&#1041;&#1086;&#1073;&#1072;&#1085; &#1057;&#1090;&#1077;&#1092;&#1072;&#1085;&#1086;&#1074;&#1080;&#1115; pronounced : Bo-Baan Stefan-o-vich ) ,&nbsp; Senior level UI lead , UI Architect, and UI developer, &nbsp; obtained an undergraduate degree [in Mechanical Engineering with a minor in Computer Science] at the Collage of VTS Pozarevac in Yugoslavia (Serbia) at 2000.&nbsp; Beginning as a freelance web developer, Boban created several websites all around the globe, from Belgrade to Chicago-area for various businesses before joining Element Solutions (former Element115) in April 2008. Before Boban joined Element115, he worked as front-end developer and web designer&nbsp; in info.com&nbsp; [International Search Engine Aggregator]<br \/>\r\n<br \/>\r\nAs a follower of web standards and emerging web technologies, Boban works to perfect the accessibility, usability, and compatibility of Element115 products. He understands the intricate balance between front and back-end user interface design. His intimate understanding of PHP, JavaScript ( AJAX, Cross Domain Functionality, jQuery, Prototype, Angular ), CSS3, and HTML5 and Responsive layout technique&nbsp; provides Element115 with invaluable insight in its iCareTools Comments implementations. Boban&rsquo;s intimate understanding of browsers compatibility and mobile devices with valuable insight in mobile presentation as a part of Element&#39;s&nbsp; services has been notice as well.<\/p>\r\n\r\n<p>Boban Stefanovic Chicago&#39;s UI\/UX developer is currently located and working in Chicago&#39;s Down Town Area.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>TAGS<\/strong>: Boban Stefanovic, Chicago area, Design Engineer, Senior UI developer, Front-End Developer, PHP, JavaScript, AJAX, Cross Domain Functionality, jQuery,&nbsp; Prototype, CSS3, HTML5, Responsive layout technique, browsers compatibility, Jefferson Park, UI developer, UX developer, UX consultant<\/p>\r\n",
			"link": "About",
			"slika": "back2.jpg",
			"date": "2012-09-05 22:00:20",
			"home": "Y",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "UI Architect, and UI developer, &nbsp; obtained an undergraduate degree [in Mechanical Engineering with a minor in Computer Science] "
		}, {
			"id": 55,
			"naslov": "Demo CMS",
			"sadrzaj": "<p>BOBAN SMC is very flexible and scalable  Content Manager System,  based on assets distribution. It is  created to accommodate and help  small businesses  and   category oriented content architecture. What makes BOBAN SMC  different than other content management systems  you have seen so far is that is small, fast , simple and very light.<\/p>\r\n<h2>What makes it special?<\/h2>\r\n<ul>\r\n    <li>Simplicity is what makes users to love BOBAN CMS.<\/li>\r\n    <li><b>You do not need to be a rocket scientist to make pages <\/b>and to organize them as well as you would do on your desktop computer or My Documents Folder.<\/li>\r\n    <li>Front end is independent so redesign, change templates and look and feel  it as you wish. You might want to choose front end frameworks capable of routing  as you plan to redesign your BOBAN CMS.<\/li>\r\n    <li>Features are implemented initially and can be upgraded or built for specific purpose as business might dictate<\/li>\r\n    <li>It s a small and easy to understand, built for small and big business models.<\/li>\r\n    <li>BOBAN CMS is initially written in Angular and PHP. Its layouts are responsive covering apperience  in mobile, tablet, desktop, and wide screens variation. <\/li>\r\n    <li>BOBAN CMS will help you reinforce your online business taking advantage of multiple languages, databases and advanced programming.<\/li>\r\n    <li>A global reach, the ability to interact and provide custom information  and ordering, and multimedia prospects.<\/li>\r\n<\/ul>\r\n\r\n\r\n<h2>Techical explanation and information<\/h2>\r\n\r\n<p>It is decoupled CMS architecture separates the back-end and front-end management of a website into two different systems: \r\n<ul><li>one for content creation and storage, <\/li>\r\n<li>and another system, one or more, are responsible for consuming that data and presenting it to the user through some interface<\/li><\/ul>\r\n<p> Once content is created and edited in the back end, this front-end takes advantage of flexible and fast web services and APIs to deliver the raw content to any front-end design on any device or channel.<\/p>\r\n\r\n<img class=responsive  src= images\/decoupled-BOBAN-CMS.jpg  \/>\r\n\r\n<p>From a technical standpoint, a BOBAN  CMS is consist of :<\/p>\r\n<ul>\r\n<li>Content Admin Panel :  A backend layer where content and digital assets are stored  (in MySQL database) <\/li>\r\n<li>Content Communicator : An API that connects the content management back end with the front end<\/li>\r\n<li>User Interface: An Angular or React, or Ecma6, or Vanila Javascript, CSS , HTML, and so on,  independent layer  for delivering data to end user   <\/li>\r\n \r\n<\/ul>\r\n<p> Even though the back end and the front-end application function independently of one another, the front-end architecture is predetermined with a specified delivery environment (for example, Angular, React or React Native). Thus, the two systems are tightly linked and can function as one.<\/p>\r\n\r\n<h2> BOBAN  CMS LIVE: <\/h2>\r\n<p><a target= _BLANK  href= http:\/\/mayadentistry.com >www.mayadentistry.com<\/a><\/p>\r\n<p><a target= _BLANK  href= http:\/\/www.dofengshui.com >www.dofengshui.com<\/a><\/p>\r\n<p><a target= _BLANK  href= http:\/\/www.stefadesign.com >www.stefadesign.com<\/a><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>BOBAN  CMS, as already mentioned,  is scalable and can be modified to accommodate  new  features and customer needs using module oriented sub content.  BOBAN CMS backend  is written in PHP and  supported by MySql database. Fronend is Angular 7 ( v.19 as 2019 edition of CMS). Its ADMIN PANEL place where content contribution happens, can be set to work remotely (for example admin panel can be located on your local computer   and content to be stored on your hosting domain database) or can be set to work with   different privileges (admin vs editorial)<\/p>\r\n",
			"link": "CMS",
			"slika": "bobanpainting-81346965807.jpg",
			"date": "2012-09-20 12:52:22",
			"home": "N",
			"promo": 0,
			"eventDate": "2013-09-19 22:00:00",
			"description": "BOBAN CMS is one of products that i am working on when I have no other projects or have inspiration to try something different. "
		}, {
			"id": 57,
			"naslov": "Boban CMS Features",
			"sadrzaj": "<p>&nbsp;BOBAN CMS is, as already mentioned, scalable and can serve small and medium businesses. It&#39;s expendable and can be modified to accommodate new features and customer&#39;s needs using module oriented sub content. It&#39;s written in PHP supported by MySql database. It can be set to work remotely (for example admin panel can be located on your local computer and content to be stored on your domain) or can be set to work with different privileges (admin vs editorial)<\/p>\r\n\r\n<h2>Boban SMC Features:<\/h2>\r\n\r\n<p><strong>VIDEO PORTAL<\/strong><\/p>\r\n\r\n<p>category oriented<\/p>\r\n\r\n<p>no limit on how many video category you will have or how many videos will be in one category.<\/p>\r\n\r\n<p>scrollable video list<\/p>\r\n\r\n<p>auto play next<\/p>\r\n\r\n<p>supported by devices running iOS or any other environment or device which supports flash or html5<\/p>\r\n\r\n<p>you do not have to store you files locally. The best performance are shown using youtube video.<\/p>\r\n\r\n<p>for any played video you can:<\/p>\r\n\r\n<p>track Google analytics<\/p>\r\n\r\n<p>track Google analytics player event<\/p>\r\n\r\n<p>add comment (feature &#39;comments&#39; starts immediately after video is loaded)<\/p>\r\n\r\n<p>video status is visible (prints current action of the video player right beside the video title)<\/p>\r\n\r\n<p>social media sharing available for any video played in player<\/p>\r\n\r\n<p><a href=\"images\/content\/videos.jpg\"><img alt=\"\" src=\"images\/content\/videos.jpg\" width=\"150\" \/> <\/a><\/p>\r\n\r\n<p><strong>COMMENTS<\/strong><\/p>\r\n\r\n<p>by default all content pages are connected with COMMENTS feature. Once page running comments are following.<\/p>\r\n\r\n<p>editable in Admin Panel<\/p>\r\n\r\n<p>answerable (you can easily respond to any comment as administrator and give suggestion or answer any comment)<\/p>\r\n\r\n<p>searchable in Admin Panel<\/p>\r\n\r\n<p><strong>PHOTO GALLERY<\/strong><\/p>\r\n\r\n<p>category organized photo gallery<\/p>\r\n\r\n<p>no limitation<\/p>\r\n\r\n<p>images are stored locally (it might be a different if needed)<\/p>\r\n\r\n<p>CSS3 adjustable<\/p>\r\n\r\n<p>very simple build. To create new photo category with photos stored into it takes just a few minutes or three clicks. Create category (one click) add new image(on more click), select category where it will be located (3rd click)&nbsp; &nbsp;&nbsp;<\/p>\r\n\r\n<p>&nbsp;the latest uploaded image in category will give category a new thumbnail so will show to&nbsp; end users action or update.<\/p>\r\n\r\n<p><a href=\"images\/content\/gallery.jpg\"><img alt=\"\" src=\"images\/content\/gallery.jpg\" width=\"150\" \/> <\/a><\/p>\r\n\r\n<p><strong>PROMOTION:<\/strong><\/p>\r\n\r\n<p>Promotion or promos is a feature that allows you to create and add small commercial or promotion to any page.<\/p>\r\n\r\n<p>Promos are having:<\/p>\r\n\r\n<p>title<\/p>\r\n\r\n<p>description \/ teaser<\/p>\r\n\r\n<p>image<\/p>\r\n\r\n<p>link to external or internal page<\/p>\r\n\r\n<p><a href=\"images\/content\/articles.jpg\"><img alt=\"\" src=\"images\/content\/articles.jpg\" width=\"150\" \/> <\/a><\/p>\r\n\r\n<p><strong>SPOTLIGHTS :<\/strong><\/p>\r\n\r\n<p>Home page can have (not mandatory) rotatable spotlights<\/p>\r\n\r\n<p>Spotlights can Rotate automatically or to be set to behave on click<\/p>\r\n\r\n<p>Spotlights can be used as a promotion of your product or service as well as a external link to your reference page.<\/p>\r\n\r\n<p>Spotlight similar as a promo has:<\/p>\r\n\r\n<p>title<\/p>\r\n\r\n<p>description \/ teaser<\/p>\r\n\r\n<p>image<\/p>\r\n\r\n<p>link to external or internal page&nbsp;<\/p>\r\n\r\n<p><a href=\"images\/content\/menu.jpg\"><img alt=\"\" src=\"images\/content\/menu.jpg\" width=\"150\" \/> <\/a><\/p>\r\n\r\n<p><strong>GO MOBILE:<\/strong><\/p>\r\n\r\n<p>Calability of Boban CMS&#39;s gives you an opportunity to run even mobile presentation!<\/p>\r\n\r\n<p>BOban CMS is writtent to respond to specification of Responsive design (RWD).<\/p>\r\n\r\n<p>Responsve Web Design covers all mobile devices no matter what screen size they will use. That applies to mobile smartPhones and tablets. &nbsp;<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>SKINS:<\/strong><\/p>\r\n\r\n<p>One of calabilities of Boban CMS&#39;s gives you an opportunity to switch look and feel!<\/p>\r\n\r\n<p>Simple clicking on available skins editor \/ administrator can change skin of web presentation.<\/p>\r\n\r\n<p>Responsve Web Design covers all mobile devices no matter what screen size they will use. That applies to mobile smartPhones and tablets. &nbsp;<\/p>\r\n\r\n<p><a href=\"images\/content\/skin.jpg\"><img alt=\"\" src=\"images\/content\/skin.jpg\" width=\"150\" \/> <\/a><\/p>\r\n\r\n<p><strong>EVENTS:<\/strong><br \/>\r\none page can behave as an even simple assigning date to it and will appear as an incoming even on the left navigation. This feature will display up to 3 incoming events (scalable again so can change to up to &#39;as you wish&#39;). When current date pass date set on page, page will be removed from even list and behave as a regular generic page. Isn&#39;t simple like that?<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>Simple to build, simple to use!<\/strong><\/p>\r\n",
			"link": "CMS",
			"slika": "back10.jpg",
			"date": "2012-09-20 13:05:34",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "List of websites that runs on BOBAN CMS engine. Much more about CMS and demo "
		}, {
			"id": 47,
			"naslov": "Skills and Experience",
			"sadrzaj": "<p>Boban Stefanovich was working as a professional front to end developer&nbsp; in last 10 years. Significant level of skills and decent amount of experience in different areas of web development helped him to produce few dozens&nbsp; of websites in just a 5 years working as an employee of Element115. Most of these website are&nbsp; for&nbsp; Health Care Industry, which makes him understand perfectly Health Industry and UI required for the best user experience.&nbsp; Currently Boban is located in Chicago Illinois - US.&nbsp;<\/p>\r\n\r\n<p>Listed below is a short list of Boban&#39;s skills and experience:<\/p>\r\n\r\n<p>&bull; Huge Experience in Content Management System functionality and UI<br \/>\r\n&bull; Fluent in : PHP,JSP, CSS,JS,HTML, HTML5, CSS3,MySQL, fluid layouts, Responsive Design, Responsive layouts<br \/>\r\n&bull; Fatwire CS Architect and Developer&nbsp;<br \/>\r\n&bull; Program JSP,PHP, xHTML, JS, DOM, CSS for customers as well as internal websites<br \/>\r\n&bull; Develop multimedia and dynamic HTML in JavaScript using Prototype and jQuery<br \/>\r\n&bull; Develop wireframes and HTML prototypes&nbsp;<br \/>\r\n&bull; Programming in PHP \/ JSP \/ Java \/ Javascript for developing web based user interfaces, fluent in Protoype and jQuery<br \/>\r\n&bull; Participates in usability testing and develop web design standards<br \/>\r\n&bull; Able to communicate complex design\/interface issues to the end-users<br \/>\r\n&bull; Huge experience in debugging and fixing bugs, browsers compatibility<br \/>\r\n&bull; Generate necessary documentation<br \/>\r\n&bull; Performs miscellaneous job-related duties as assigned<br \/>\r\n&bull; Experience \/ familiarity with Version Control Software and SVN<br \/>\r\n&bull; Ability to work in a small team environment with minimal supervision<br \/>\r\n&bull; Skilled in the use of XML technology<br \/>\r\n&bull; Ajax and cross domain communication and cross browsers layouts<br \/>\r\n&bull; Mobile Application and Mobile web application<br \/>\r\n&bull; Excellent written and oral communication skills<\/p>\r\n\r\n<p>In other words Front&nbsp; to End Developer ideal as a candidate to work on corporate or company&#39;s website.&nbsp; So go ahead take a look on my recently done projects and let me know if you have any question.&nbsp;<\/p>\r\n\r\n<p>Boban Stefanovich - Chicago based web developer, php,&nbsp; User Interface, and User Experience designer.<\/p>\r\n\r\n<p>Boban Stefanovic Chicago&#39;s UI developer is currently located and working in Chicago&#39;s Down Town Area.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>TAGS: <\/strong>Boban Stefanovic, Portfolio Boban Stefanovich, Chicago web developer, Chicago based freelance web developer, php,&nbsp; User Interface ,User Experience designer, UI&nbsp;DEveloper,&nbsp; Drupal, Wordpress, Nuke, Fatwire, Oracle WebCenter,&nbsp; front end back end developer, Design Engineer, JavaScript, Prototype plugins, jQuery plugins,<\/p>\r\n",
			"link": "",
			"slika": "avatars-000056843916-uwtgyx-t200x2001403317612.avatars-000056843916-uwtgyx-t200x200.jpg",
			"date": "2012-09-05 21:46:33",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": ""
		}, {
			"id": 61,
			"naslov": "Scheduled Appointments",
			"sadrzaj": "We are using chatbot to help us schedule your call with us. In order to do so , please click on help button on right side of your screen and type appointment \/ call. \r\n\r\n<iframe\r\n    src=\"https:\/\/calendar.google.com\/calendar\/embed?src=dbtqe2dbmb801kebdlp3bccbso%40group.calendar.google.com&ctz=America%2FChicago\"\r\n    style=\"border: 0\"\r\n    width=\"800\"\r\n    height=\"600\"\r\n    frameborder=\"0\"\r\n    scrolling=\"no\"\r\n  ><\/iframe> ",
			"link": "About",
			"slika": "",
			"date": "2012-11-08 09:41:40",
			"home": "N",
			"promo": 0,
			"eventDate": "2014-06-18 22:00:00",
			"description": "We are using chatbot to help us schedule your call with us. In order to do so , please click on help button on right side of your screen and type appointment \/ call. "
		}, {
			"id": 50,
			"naslov": "Work and Projects",
			"sadrzaj": "<p>As team member of Element Solutions (former Element115), I was playing different roles depending on project and business needs: UI Architect, UI Tech Lead, UI developer, UX consultant&nbsp; for customers on various Industry based Enterprise projects.<\/p>\r\n\r\n<h1>2016:<\/h1>\r\n\r\n<p><strong>Broadcom Limited<\/strong> (UI Architect, UI Tech Lead, UI Developer ) is a leading designer, developer and global supplier of a broad range of analog and digital semiconductor connectivity solutions , mixed signal and optoelectronics components and subsystems.<\/p>\r\n\r\n<p><strong>Pella Professionals Blog&nbsp;<\/strong>(UI Architect,&nbsp; UI Developer )<strong> -<\/strong>The <strong>Pella Corporation<\/strong> is a privately held <a href=\"https:\/\/en.wikipedia.org\/wiki\/Window\">window<\/a> and <a href=\"https:\/\/en.wikipedia.org\/wiki\/Door\">door<\/a> manufacturing company headquartered in <a href=\"https:\/\/en.wikipedia.org\/wiki\/Pella,_Iowa\">Pella, Iowa<\/a>, and with manufacturing and sales operations in a number of locations in the <a href=\"https:\/\/en.wikipedia.org\/wiki\/United_States\">United States<\/a>.<\/p>\r\n\r\n<p><strong>Sunbelt Rental <\/strong>(UI Architect) - One of the largest equipment rental companies in North America and backed by a network of more than 550 locations, Sunbelt Rentals successfully services a variety of customers - from those in the commercial, residential, industrial, municipal, and specialized service industries, to weekend do-it-yourselfers.<\/p>\r\n\r\n<p>&nbsp;\r\n<h1>2015:<\/h1>\r\n<\/p>\r\n\r\n<p><strong>Avago <\/strong>(UI Architect, UI Tech Lead, UI Developer ) <strong>- <\/strong>designer, developer and supplier of analog, digital, mixed signal and optoelectronics components and subsystems.<\/p>\r\n\r\n<p><strong>The Pella Corporation&nbsp;<\/strong>(UI Architect, UI Tech Lead)<strong> <\/strong>is a privately held window and door manufacturing company headquartered in <em>Pella<\/em>, Iowa, and with manufacturing and sales operations<\/p>\r\n\r\n<p><strong>Pella crafted luxury&nbsp;<\/strong>(UI Architect, UI Tech Lead )<strong> - <\/strong>Luxury,&nbsp; Pella Corporation<\/p>\r\n\r\n<p><strong>Floyd Medical Center&nbsp;<\/strong>(UI Developer )<strong> <\/strong>- a system of health care providers serving Northwest Georgia and Northeast Alabama<\/p>\r\n\r\n<p><strong>North-West Memorial Hospital<\/strong> - <strong>Intranet&nbsp; NMI project<\/strong> (UI Architect, UX consultant, AI, UI Tech Lead, UI Developer )- a nationally ranked academic medical center hospital located in downtown Chicago Illinois.<\/p>\r\n\r\n<p><strong>North-West Memorial Hospital<\/strong> - <strong>CNX Connections Intranet redisign project<\/strong>- (UI Architect, UI Developer ) a nationally ranked academic medical center hospital located in downtown Chicago Illinois.<\/p>\r\n\r\n<p><strong>BMIQ <\/strong>(<strong>ex Cardio metabolic Support network System<\/strong>) (UI Architect,&nbsp; UI Developer )- A comprehensive medical weight loss program designed for Health Care Professionals to deliver in a variety of settings.<\/p>\r\n\r\n<h1>&nbsp;<\/h1>\r\n\r\n<h1>2014:<\/h1>\r\n\r\n<p><strong>Vendy&#39;s<\/strong> (UI Developer ) an American international fast food chain restaurant<\/p>\r\n\r\n<p><strong>The <em>University of Michigan<\/em>&nbsp;<\/strong>( UI Developer )<strong> -<\/strong> is a public research university located in Ann Arbor, Michigan.<\/p>\r\n\r\n<p><strong>The <em>University of Chicago<\/em><\/strong> (UI Architect )- a private research university in Chicago<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h1>2013:<\/h1>\r\n\r\n<p><strong>Rewards Network<\/strong> Chicago<\/p>\r\n\r\n<p><strong>Amtrak <\/strong><\/p>\r\n\r\n<p><strong>North-West Memorial Hospital<\/strong> - Chicago<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h1>2012 :<\/h1>\r\n\r\n<p><strong>North-West Memorial Hospital <\/strong>- Chicago - CNX Connections - and DAAM ...and more..<\/p>\r\n\r\n<p><strong>BMIQ <\/strong>(<strong>ex Cardio metabolic Support network System<\/strong>)<\/p>\r\n\r\n<p><strong>Adventist Health<\/strong> various design related work, code implementation, CORE2 based work , eHA modifications and improvement<\/p>\r\n\r\n<p><strong>Children&rsquo;s Hospital of Philadelphia<\/strong> [redesign, front-end , functionality and back-end]<\/p>\r\n\r\n<p><strong>Children&rsquo;s Hospital of Philadelphia CCP<\/strong> [design, front-to back-end]<\/p>\r\n\r\n<p><strong>Bell helicopter<\/strong><\/p>\r\n\r\n<p><strong>Adventist Health <\/strong>System Corporate website,[design, CSS,JS]<\/p>\r\n\r\n<p>Adventist Health: San Joaquin Hospital ,[design, CSS,JS]<\/p>\r\n\r\n<p>Adventist Health: St. Helena Hospital ,[front to end, Fatwire architect , front-end developer]<\/p>\r\n\r\n<p>Adventist Health: Sonora Hospital [ Fatwire architect , front-end developer]<\/p>\r\n\r\n<p>Adventist Health: Wall Walla Hospital... [ Fatwire architect , front-end developer]<\/p>\r\n\r\n<p>Adventist Health:Tillamook County Hospital Website...[ Fatwire architect , front-end developer]<\/p>\r\n\r\n<h1>&nbsp;<\/h1>\r\n\r\n<h1>2011-2010<\/h1>\r\n\r\n<p><strong>North Shore Long Island Jewish Health System<\/strong> - corporate<\/p>\r\n\r\n<p>North Shore Long Island Jewish Health System -The Feinstein Institute<\/p>\r\n\r\n<p>North Shore Long Island Jewish Health System - Cancer, and more...<\/p>\r\n\r\n<p><strong>The University of Alabama at Birmingham<\/strong> Corporate<\/p>\r\n\r\n<p>The University of Alabama at Birmingham Woman&#39;s health<\/p>\r\n\r\n<p>The University of Alabama at Birmingham Cancer<\/p>\r\n\r\n<p>The University of Alabama at Birmingham Hart and Vascular<\/p>\r\n\r\n<p>The University of Alabama at Birmingham intranet, and more...<\/p>\r\n\r\n<h1>&nbsp;<\/h1>\r\n\r\n<h1>2010-2008<\/h1>\r\n\r\n<p><strong>Cardio metabolic Support network System<\/strong><\/p>\r\n\r\n<p><strong>Carillion clinics<\/strong>&hellip;<\/p>\r\n\r\n<p><strong>The University of Michigan<\/strong><\/p>\r\n\r\n<h1><br \/>\r\nMobile [smart phones and palm devices]&nbsp; 2012 -2010<\/h1>\r\n\r\n<p><strong>Atlanta Medical Center <\/strong>- mobile<\/p>\r\n\r\n<p><strong>North-West Memorial Hospital<\/strong> - Chicago - mobile<\/p>\r\n\r\n<p><strong>North Shore Long Island Jewish Health System<\/strong> - New York - mobile<\/p>\r\n\r\n<p><strong>The University of Alabama at Birmingham<\/strong> mobile<\/p>\r\n\r\n<p><strong>Adventist Health<\/strong> mobile<\/p>\r\n\r\n<p><strong>Adventist Health San Joaquin Hospital <\/strong>mobile&hellip;<\/p>\r\n\r\n<p><strong>Adventist Health: St. Helena Hospital<\/strong> mobile<\/p>\r\n\r\n<p><strong>Adventist Health: Sonora Hospital <\/strong>mobile<\/p>\r\n\r\n<p><strong>Adventist Health: Wall Walla Hospital<\/strong> mobile<\/p>\r\n\r\n<p><strong>Adventist Health:Tillamook County Hospital<\/strong> mobile<\/p>\r\n\r\n<h1><br \/>\r\nInternal E115 Projects 2012 -2008:<\/h1>\r\n\r\n<p><strong>Element115&nbsp; <\/strong>[Design, logo, website front-end, rebranding e115]<\/p>\r\n\r\n<p>icaretools - Mobile Presentation [front-back end JSP]<\/p>\r\n\r\n<p>Icaretools - Comments API [ front-end cross domain functionality ]<\/p>\r\n\r\n<p>Icaretools - Comments Administration Panel [font-back end, PHP, Oracle,&nbsp; across domain functionality]<\/p>\r\n\r\n<p>Icaretools - Comments Administration Panel Remote [font to back end PHP, Oracle,&nbsp; across domain functionality]<\/p>\r\n\r\n<p>eSA design<\/p>\r\n\r\n<h1>2011-2008<\/h1>\r\n\r\n<p>As a part of support team Boban was working on various projects : Bell Helicopter, Amtrak, Cessna, Jrcert, Children&rsquo;s Hospital of Philadelphia, SummitHealth, NMH and more ...<\/p>\r\n",
			"link": "About",
			"slika": "back13.jpg",
			"date": "2012-09-05 22:20:13",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": ""
		}, {
			"id": 51,
			"naslov": "History: BG Lighthouse",
			"sadrzaj": "<p><strong>Employer Description: <\/strong>BGS  Belgrade (BG Svetionik - Belgrade Lighthouse) is a Web Development Web Hosting company from city of   Belgrade Serbia located in neighborhood of monastery St.Sava. Web   business,&nbsp; design, hosting and development is what BGS does the best.   Having over hundred references and clients with only 12 people in team   BGS is very proud of success and prosperity of it\"s small team.<\/p>\r\n<p><strong><span class=\"st\">Job title<\/span><\/strong>: Web Designer , Web Developer<\/p>\r\n<p><strong><span class=\"st\">Date of employment<\/span><\/strong><span class=\"st\">. <\/span>: 2002-2005<\/p>\r\n<p><strong>Thanks to <\/strong>: Emir Svemir , CEO Blagota Marojevich and&nbsp; HR&nbsp;VDP Milena Marojevich. You guys rock!<\/p>",
			"link": "About",
			"slika": "bobanpainting-31346965029.jpg",
			"date": "2012-09-06 16:20:31",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "We are one of the leading companies in Serbia in the field of web development, and we have been providing our services to many companies in our country and region for fifteen years. Our team consists of an assembly of young people with strong individual qualities and experience, who are experts in front end development, back end development, web design and SEO. We develop long-term, successful business partnerships. When we complete your digital project, we offer support and our desired result is that you consider us to be part of your team."
		}, {
			"id": 52,
			"naslov": "History: UFP Technologies Addison",
			"sadrzaj": "<p><strong>Employer Description:<\/strong> UFP Technologies,  headquartered in Georgetown, Massachusetts with twelve  North American  manufacturing locations, is a custom converter  specializing in  fabricating specialty foams, plastics, and natural fiber  materials into  packaging, components, and end products.   The company\"s  core business  is foam fabrication, where it specializes in creating  custom solutions  with diverse materials and converting expertise. The  company serves a  myriad of manufacturing sectors, but specifically  targets opportunities  in the automotive, computers and electronics,  medical and scientific,  aerospace and defense, consumer, and industrial  markets.<\/p>\r\n<p><strong><span class=\"st\">Job title<\/span><\/strong>: AutoCAD Designer<\/p>\r\n<p><strong><span class=\"st\">Date of employment<\/span><\/strong><span class=\"st\">. <\/span>: 2005-2006<\/p>\r\n<p><strong>Summary:<\/strong> Working in UFP Technologies was awesome. I  just moved into US and that was my first job.&nbsp;   From start to finish, I  had nothing but a good time.  Met  some really cool people, got all my  questions answered, and  even took care of ESL for the next two years!<\/p>\r\n<p>Credits and Thanks to Dalibor, David Chavez, Ruddy, Jimmy.<\/p>",
			"link": "About",
			"slika": "bobanpainting-101346965901.jpg",
			"date": "2012-09-06 16:29:22",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "UFP Technologies is a critical link in the value chain between raw material suppliers and OEMs. We specialize in creating custom packaging, component and product solutions for the following markets: medical, automotive, aerospace, defense, industrial, electronics and consumer."
		}, {
			"id": 53,
			"naslov": "History: Info.com ",
			"sadrzaj": "<p><strong>Employer Description <\/strong>: Info.com (Chicago, Illinois) is a search platform  that pulls together the best of breed  search tools. From a single  search query, Info.com provides results from  the leading search engines  and pay-per-click directories. Info.com is  also partnered with other  search providers to include comparison  shopping and product reviews, a  broad selection of news, health,  pictures, eBay, jobs, White and Yellow  Pages, tickets, flights, hotels,  weather, maps and directions.<\/p>\r\n<p><strong><span class=\"st\">Job title<\/span><\/strong>: Web Designer , Web Developer<\/p>\r\n<p><strong><span class=\"st\">Date of employment<\/span><\/strong><span class=\"st\">. <\/span>: 2006-2007<\/p>\r\n<p><strong>Summary<\/strong>: I was really enjoying all my time spent  with all these beautiful people  from info.com. High educated and very  inteligent people around me in  info\"s office every day helped me to  enhance my knowledge and skills,  knowledge of SEO, different types of  search platforms, keywords and  keywords business,&nbsp; and lot of other  useful  web techniques. Special  thanks to Juliet Diiorio who found me  as an unique and worthy developer&nbsp;  to join info.com team. Special  credits and thanks to all people from info.com office:  John Joslin,  Adam, Jen, DD , and WarCraft Fans from office &quot;B&quot;.<span id=\":to\" class=\"hP\"> <\/span><\/p>\r\n<p><span id=\":to\" class=\"hP\">P.S. <\/span><\/p>\r\n<p><span id=\":to\" class=\"hP\">I still feel sorry I never made it on that party at <\/span><span class=\"hP\">beautiful backyard garden after work on Thursday and wish Juliet a good life, post info.com <\/span><span id=\":to\" class=\"hP\">!<\/span><\/p>",
			"link": "About",
			"slika": "back.jpg",
			"date": "2012-09-06 16:31:40",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "One of first jobs I obtained in US was programmer in  Info.com. Such a beautiful people, and real friends  I had in there "
		}, {
			"id": 54,
			"naslov": "History: Element 115 Chicago ",
			"sadrzaj": "<p><strong>Employer Description: <\/strong>Element115.net is an  innovative enterprise technology  company focused  on web content  management solutions for public and internal web sites.  Our  organization has grown by providing industry-leading software   solutions, superior technical and professional services, web marketing   and brand expertise, and the highest quality customer support.<\/p>\r\n<p><strong><span class=\"st\">Job title<\/span><\/strong>: Senior Design Engeneer,&nbsp; Senior Web Designer , Web Developer, Senior Front-end Developer<\/p>\r\n<p><strong><span class=\"st\">Date of employment<\/span><\/strong><span class=\"st\">. <\/span>: 2007-<em>Current date<\/em><\/p>",
			"link": "",
			"slika": "stefadesign-adminpanel21348160969.jpg",
			"date": "2012-09-06 16:33:06",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "Element115.net is an  innovative enterprise technology  company focused  on web content  management solutions for public and internal web sites."
		}, {
			"id": 62,
			"naslov": "Responsive vs. adaptive vs. reactive",
			"sadrzaj": "<p>A <strong>responsive <\/strong>layout is in theory always better than an adaptive layout, but in some cases an adaptive layout is a more pragmatic solution. In other hand, an adaptive layout will give you more control over the design. In a responsive layout you easily have hundreds of states &mdash; sure, most of them with very minor differences, but they are different which makes it harder to know what would you design look like. Additionally responsive design makes it difficult to test and predict with absolute certainty.<\/p>\r\n\r\n<p><br \/>\r\nAn <strong>adaptive <\/strong>layout can be a good start in cases when resources or time are an issue (especially when dealing with an existing website, where a complete rewrite is not always a solution).&nbsp; An adaptive layout has its merits in other hand because it can be a more pragmatic solution that is cheaper to implement and easier to test. An adaptive layout can be considered the cheaper sibling of a responsive layout and can thus be appealing if resources are tight.<\/p>\r\n\r\n<p><br \/>\r\nAs a third approach there is <strong>Reactive <\/strong>Layouts and design which became a solution according to customer&quot;s decision to control content on different devices. Logically this approach has my curiosity and I can see reason of its existence. Philosophically it happens that users using different devices are expecting different content according to device they are using. It makes sense, just imagine yourself laying in sofa at the front of TV and surfing internet using iPad... What is that you expect to see? Same content as on desktop computer? Or let say you need your doctor office phone number but you know only website so you park your car you take your smartphone and you search for your doctor&quot;s number on website. First screen you get is &quot;What&quot;s New &quot; section loading huge banners you do not need but page still loads...&nbsp;Simple proof that in this case you need REACTIVE&nbsp;design would be in this particular cases where users exact different content to appear. For example let&quot;s say&nbsp; &quot;Health based website&quot; like let&quot;s say &quot;city hospital&quot; website. Who needs &quot;the latest news&quot;, &quot;deals&quot;, &quot;CEO testimonials&quot; and other news like press related information on mobile version of website?&nbsp; It is very obvious that user is looking for Parking, Location, Phone Number, Urgent Care, Emergency room location or doctor&quot;s office number, etc&hellip;<\/p>\r\n\r\n<p><br \/>\r\nSince parallel has been created, in my personal opinion, we are talking about three different things:<\/p>\r\n\r\n<p>Teaching techniques (book like) and&nbsp; smart planning approach (use of Responsive Layouts)<\/p>\r\n\r\n<p>Business approved or cheaper layouts (use of Adaptive Layouts)<\/p>\r\n\r\n<p>Business needed&nbsp; (use of Reactive Layouts: displaying content appropriate for device and user&quot;s needs according to device reading website)<\/p>\r\n\r\n<p>Well, looks like we hit the wall and solutions are ready&nbsp;for customers or project managers to make decision and determine&nbsp;approach hence designers and UI professionals sometimes have a problem to be accepted as necessary professional assistance in discovery phase &nbsp;:(<\/p>\r\n",
			"link": "Blog",
			"slika": "responsive1421451207.responsive.jpg",
			"date": "2012-11-13 08:54:45",
			"home": "N",
			"promo": 0,
			"eventDate": "2015-03-18 22:00:00",
			"description": "An old subject responsive or adaptive, which one approach to chose why and when? "
		}, {
			"id": 78,
			"naslov": "Things Every Javascript Developer Should Know",
			"sadrzaj": "<p>Javascript is an ever-growing language, especially now that releases for ECMAScript specifications now operate on a yearly release schedule. As such the importance of needing to know Javascript beyond just jQuery becomes even more important as the language grows in scope and quite quickly.<\/p>\r\n\r\n<p>This isn&rsquo;t a definitive guide that claims to be the holy grail of Javascript developer knowledge. There are definitely things I have missed, things I might be wrong about and things you might disagree with as being something every Javascript developer should know.<\/p>\r\n\r\n<h2>How to FizzBuzz<\/h2>\r\n\r\n<p>Often regarded as a nice coding exercise to weed out the inexperienced developer earlier on in the interviewing process, you would be surprised how many Javascript developers do not know how to write a basic FizzBuzz test.<\/p>\r\n\r\n<p>The FizzBuzz test serves no practical real world purpose whatsoever. It is purely a simple exercise to test would-be candidates on their coding abilities.<\/p>\r\n\r\n<p>Keep in mind most places you will interview at for a front-end\/Javascript development position there is a high chance you will be asked a FizzBuzz question: are you ready?<\/p>\r\n\r\n<p><strong>This is the classic FizzBuzz:<\/strong><br \/>\r\nKeep in mind that you might be asked to solve different variants of FizzBuzz. I went to an interview once where I was asked to solve the basic variant and then two other variants.<\/p>\r\n\r\n<p>This particular example prints out &ldquo;Fizz&rdquo; at multiples of 3. Prints out &ldquo;Buzz&rdquo; at multiples of 5 and prints out &ldquo;FizzBuzz&rdquo; at multiples of 3 and 5.<\/p>\r\n\r\n<p><em><strong>Note: A slight change was made to this implementation from what it was earlier. Conditional if statements are used and the number is printed out if it isn&rsquo;t one of the conditional multiples. The existing solution did work, but it did not print out non conditional numeric values or use conditional ifs.<\/strong><\/em><\/p>\r\n\r\n<p>for (var i = 1; i &lt;= 100; i++) { if (i % 15 === 0) { console.log(&#39;FizzBuzz&#39;); } else if (i % 3 === 0) { console.log(&#39;Fizz&#39;); } else if (i % 5 === 0) { console.log(&#39;Buzz&#39;); } else { console.log(i); } }<\/p>\r\n\r\n<h2>The difference between == and ===<\/h2>\r\n\r\n<p>Once again, two comparison operators you are probably familiar with. However, do you know what the difference is between double and triple equal comparison operators? Your Javascript linter tells you to use triple equals, but do you know why?<\/p>\r\n\r\n<p><strong>==<\/strong> Double equals (aka loose equality) will not compare the type, however it will typecast values being compared within the statement. This is called type coercion and it is regarded as an evil operation.<\/p>\r\n\r\n<p>console.log(24 == &#39;24&#39;); \/\/ true<\/p>\r\n\r\n<p>As you can see, our value of 24 within single quotes which is a string is being typecast to a number instead. While there might be situations where this is the desired behaviour, allowing the comparison operator to change your type is probably not what you want to do.<\/p>\r\n\r\n<p>Using the double equals is not recommend and most sane Javascript linters will throw an error telling you to use the strict equality comparison operators instead by default. If you want to coerce values, do so outside of the condition not within it.<\/p>\r\n\r\n<p><strong>===<\/strong> Triple equals (aka strict equality) will compare the type, but will not typecast the values meaning they are compared as is without being transformed. Because there is no type coercion, the triple equals is faster and the recommended approach for comparing all kinds of values. This means both types need to be the same for the condition to equal true.<\/p>\r\n\r\n<p><strong>The same example as above, but triple equals:<\/strong><\/p>\r\n\r\n<p>console.log(24 === &#39;24&#39;); \/\/ false<\/p>\r\n\r\n<p>The reason false is being returned is because we are comparing a number to a string. Obviously they are two different distinct types, so it will return false as the result because they are compared as is.<\/p>\r\n\r\n<p>I highly suggest you read up more on equality comparisons on the Mozilla Developer site <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Equality_comparisons_and_sameness\">here<\/a>. It has some great explanations (better than mine) and also some examples.<\/p>\r\n\r\n<h2>How to query the DOM without a 3rd party library<\/h2>\r\n\r\n<p>You probably know how to query the DOM using jQuery quite well, but can you do it using native methods in Javascript without resorting to the use of a third party library?<\/p>\r\n\r\n<p>I am not just talking about being able to query the page for an element with an ID or elements with a particular class, I mean jQuery like expressions for finding elements in the DOM.<\/p>\r\n\r\n<p>There are quite a few native methods we can use that are just as powerful as jQuery for finding one or more elements within a page. We can use selectors like first-child, last-child and more. You would be surprised just how good native DOM querying methods are nowadays.<\/p>\r\n\r\n<p><strong>Study these native methods and use them in place of something like jQuery:<\/strong><\/p>\r\n\r\n<p>Where necessary I have linked off to Mozilla&rsquo;s developer documentation for further reading. Anywhere you see a link, if you&rsquo;re not too familiar with something, I highly recommend you click it.<\/p>\r\n\r\n<p>document.getElementById &ndash; The classic query for finding elements via their ID.<\/p>\r\n\r\n<p>document.getElementsByClassName &ndash; Finding elements in the DOM via their className value.<\/p>\r\n\r\n<p><a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/API\/Document\/querySelector\">document.querySelector<\/a> &ndash; This is a great method. It has all of the power of a jQuery $() however, it is native. This will only return the first element that it finds though.<\/p>\r\n\r\n<p><a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/API\/Document\/querySelectorAll\">document.querySelectorAll<\/a> &ndash; Pretty much the same as the above method except that it returns multiple elements that it finds and not just the first one.<\/p>\r\n\r\n<p>document.getElementsByTagName &ndash; This allows you to query for elements of a particular tag name. Want to find all DIV elements in the page or span tags? This is the method you want.<\/p>\r\n\r\n<p>Worth mentioning is is the querySelector and querySelectorAll methods can also be used on an Element meaning you can query the contents of an element using these methods.<\/p>\r\n\r\n<p>Read more about <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/API\/Element\/querySelector\">Element.querySelector<\/a> and <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/API\/Element\/querySelectorAll\">Element.querySelectorAll<\/a> for examples of their use.<\/p>\r\n\r\n<h2>Hoisting<\/h2>\r\n\r\n<p>Javascript is an interesting language purely from the way declarations are hoisted to the top of a scope. This means you can actually reference a variable before you&rsquo;ve defined it within the current scope (so for example a function is considered its own scope).<\/p>\r\n\r\n<p>As a rule of thumb: ALWAYS define your variables at the top of your desired scope. If you are using &lsquo;use strict&rsquo;; at the top of your script files (or within your functions), an error will be thrown if you try using a variable before it has been defined.<\/p>\r\n\r\n<p>Most Javascript linters like Jshint will complain if you haven&rsquo;t defined &lsquo;use strict&rsquo; anyway, so provided you&rsquo;re applying best practices it should be impossible to use variables before they are defined.<\/p>\r\n\r\n<p>As always the Mozilla Developer documentation has a great article on grammar and types in Javascript and a section which touches upon hoisting <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Guide\/Grammar_and_types#Variable_scope\">here<\/a>.<\/p>\r\n\r\n<h2>How to use browser developer tools<\/h2>\r\n\r\n<p>More specifically how to debug Javascript, but also being aware of the other tools you get in the developer tools. How to set a breakpoint and step in and through a certain subset of code within your application.<\/p>\r\n\r\n<p>These tools are important because they allow you to trace the steps in a potentially complicated application and find what is causing an issue or particular bottleneck. Knowing how to set a breakpoint, how to really drill down into your code on a molecular level and see things as they happen.<\/p>\r\n\r\n<p>Understanding the tools that come bundled within Chrome, Firefox and later versions of Internet Explorer is an essential skill to have, especially if you find yourself working with Javascript a lot. Also being aware of the various developer tool addons like Angular&rsquo;s <a href=\"https:\/\/chrome.google.com\/webstore\/detail\/angularjs-batarang\/ighdmehidhipcmcojjgiloacoafjmpfk?hl=en\">Batarang extension<\/a> for Google Chrome that allows you to debug AngularJS applications.<\/p>\r\n\r\n<p>Never blindly optimise your code without first using the appropriate tools to find actual problems and go from there. Solving problems before you have them is called premature optimisation and can be a waste of time.<\/p>\r\n\r\n<h2>Console commands<\/h2>\r\n\r\n<p>Leading off from the last point, in addition to knowing how to use profiling and debugging tools in Chrome, Firefox or Internet Explorer Developer tools, you should also be aware of the various console commands you can use.<\/p>\r\n\r\n<p>You probably already know of console.log and possibly console.error but there are actually a few useful console commands you can use.<\/p>\r\n\r\n<p>Please keep in mind that some of these commands might not work in various browsers. I have been mindful to only list commands that should be well supported in modern browsers, but always try before you go littering your code with potentially unsupported commands.<\/p>\r\n\r\n<p>console.log &ndash; For basic logging, I use this for general messages about actions taking place within my code. Format identifiers are also supported within this console call.<\/p>\r\n\r\n<p>console.error &ndash; For logging errors in your code. I use console.error within error callbacks on AJAX requests and anywhere else an error might be thrown. While similar to console.log, this method also includes a stack trace where the error was thrown.<\/p>\r\n\r\n<p>console.dir(object) &ndash; This handy method can print out a Javascript representation of an Object in your console window. Can be quite handy.<\/p>\r\n\r\n<p>console.group(title) &ndash; This allows you to create a group of console logging commands with an optional title. Meaning you can group similar logging messages together say for example when a section of code is responsible for one task.<\/p>\r\n\r\n<p>console.groupCollapsed &ndash; Exactly the same as the above method, except for the fact the initial group is collapsed and not opened.<\/p>\r\n\r\n<p>console.groupEnd &ndash; This allows you to end the group defined above.<\/p>\r\n\r\n<p>console.time(label) &ndash; Allows you to benchmark how long a particular block of Javascript code takes in milliseconds. Especially helpful for benchmarking possible bottleneck methods.<\/p>\r\n\r\n<p>console.timeEnd(label) &ndash; Similar to the groupEnd method, this allows you to stop the timer logging function and the elapsed time will be printed out in the console.<\/p>\r\n\r\n<p>copy(string) &ndash; There is a method in the Chrome and Firefox console that allows you to copy the contents of a string to the clipboard. Open up Developer Tools and try it, it can come in handy at times.<\/p>\r\n\r\n<h2>Know what this is<\/h2>\r\n\r\n<p>The this keyword can be one of the biggest sources of frustration for a Javascript developer who doesn&rsquo;t understand how it works. It can be really easy to fall into one of the many pitfalls: the biggest one being what &ldquo;this&rdquo; is depending on how you have your Javascript structured.<\/p>\r\n\r\n<p>In more traditional programming languages this is a reference to the current object instantiated by the class. But Javascript isn&rsquo;t a traditional programming language, so this actually belongs to the object that owns the method.<\/p>\r\n\r\n<p>The easiest way to remember what this does in Javascript is to remember it as being the owner, the parent if you will. The this value will always equal that of the owner, unless changed otherwise using call, apply or bind.<\/p>\r\n\r\n<p><strong>Inside of a function like below, this is actually window:<\/strong><\/p>\r\n\r\n<p>function myFunction() { console.log(this === window); \/\/ true } myFunction();<\/p>\r\n\r\n<p>You are probably thinking: why is this equal to window if we were referencing this within a method? If you know the answer then that&rsquo;s awesome, but if not, keep reading we&rsquo;ll explain why.<\/p>\r\n\r\n<p>When you define a function like above, it is bound to the global window global object. Remember we mentioned above that Javascript treats the value of this as the Object which owns the method, not the current object?<\/p>\r\n\r\n<p><strong>Changing the value of this to belong to its entirely own new object (not window):<\/strong><\/p>\r\n\r\n<p>function myFunction() { console.log(this === window); \/\/ false } new myFunction();<\/p>\r\n\r\n<p>The code purists are probably decrying what I have just done. Remember we are only loosely touching upon basic concepts. But as you can see, the value of this is no longer window. Why?<\/p>\r\n\r\n<p>The simplest explanation is when we use the new keyword, we are creating an entirely new context (hence the new keyword), the new operator will create an entirely new object.<\/p>\r\n\r\n<p>In the below example we are going to create a fictitious API fetching library with a method for fetching the data from a server. As you can see we are creating an object called API and adding in our method.<\/p>\r\n\r\n<p>Because we have created a new Object something magical happens. The context switches from the global object to that of the API object we have created instead.<\/p>\r\n\r\n<p>var API = { getData: function() { console.log(this === window); \/\/ false console.log(this === API); \/\/ true } }; API.getData();<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>As you can see, the value of this inside of a function is determined by how it is called. Because the function is being called as part of the API object, it is its owner and therefore becomes the value of this.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Never assume the value of this is always the same. It changes depending on how a function is called, however if you are using bind then the value of &ldquo;this&rdquo; is always equal to the value specified in the bind method.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Some further reading on &ldquo;this&rdquo; can be found <a href=\"http:\/\/www.quirksmode.org\/js\/this.html\">here<\/a> on Quirksmode. It runs through some examples and explains things further than I have. The Mozilla Developer documentation also has some great explanations on &ldquo;this&rdquo; complete with examples <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Reference\/Operators\/this\">here<\/a>.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>&lsquo;use strict&rsquo;;<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>As briefly touched upon earlier, use strict (which was added in ECMAScript 5) allows you to enable a more strict variant of Javascript. Every bit of Javascript you write should use this and for good reason.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>By default Javascript is a little forgiving in what it will let you do. It will fail silently when you reference a variable before it is declared and try do various other things you didn&rsquo;t realise were bad, but Javascript wasn&rsquo;t telling you.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>There is a whole article on the subject here over at <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Reference\/Strict_mode\">Mozilla Developer<\/a> and I implore that you read it because it goes into more detail than I have here.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>How to write various types of loops<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>You would be surprised how many developers I have come across who don&rsquo;t know how to write a proper for..loop nor aware of the other types of loops you can write in Javascript. Being able to loop through an array or object is an essential skill all Javascript developers should have.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>There is no one size fits all for loops, however you should know when you can &amp; should use one over the other. You might be familiar with for and while, but perhaps the others listed here not so much.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>The different types of loop we have in Javascript:<\/strong><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>for<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>for..in<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>for..of (added in ES6)<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>forEach<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>while<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>do..while<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h3>For..loop<\/h3>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>The essential basic loop every Javascript developer needs to know well. At its core a for loop is a recurring if statement that will continue provided condition 2 equals true.<\/p>\r\n\r\n<p>for (condition 1; condition 2; condition 3) { \/\/ Your code }<\/p>\r\n\r\n<p><strong>Condition 1<\/strong> &ndash; Executed before the loop begins. Most commonly you will define a counter value and the overall length of the array you are iterating. This can be omitted in place of a semicolon if you have done the setup beforehand.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>Condition 2<\/strong> &ndash; This is the condition that dictates if the loop continues or not. You commonly will compare the current counter value to that of the overall length of the array. This is a true or false value, while the value equals true, the loop will keep running. This can be omitted in place of a semicolon forcing you to break the loop inside or you can end up with an infinite loop.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>Condition 3<\/strong> &ndash; This is run after each iteration of the loop. Most commonly you will increment a counter value here (probably in 99% of use cases). This value can be omitted in place of a semicolon as well (like when incrementing your loop from inside).<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h3>For..in Loop<\/h3>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>The second most essential loop every Javascript developer should know. It allows you to iterate the properties of an object aka its keys. Lets view an example, shall we?<\/p>\r\n\r\n<p>var person = {first_name: &#39;Dwayne&#39;, last_name: &#39;Charrington&#39;, age: 27, star_sign: &#39;Aquarius&#39;}; \/\/ The below loop will output: \/\/ &quot;Dwayne&quot; \/\/ &quot;Charrington&quot; \/\/ 27 \/\/ &quot;Aquarius&quot; for (var p in person) { if (person.hasOwnProperty(p)) { console.log(person[p]); } }<\/p>\r\n\r\n<p>You probably noticed that I am using a method called <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Reference\/Global_Objects\/Object\/hasOwnProperty\">hasOwnProperty<\/a>. This method checks whether or not the object has the specified property directly on its prototype, not an inherited value. Most Javascript linters will throw an error if you do not use hasOwnProperty within your for..in loops.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h3>For..of Loop<\/h3>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>This is a recently new addition in ES6 and as such, it is not that well supported in browsers just yet. However, through the use of a transpiler, you can use it today without recourse.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>The for..of loop is sort of the inverse of the for..in except that it iterates values &amp; can only iterate over iterable objects of which Object is not a part of for obvious reasons.<\/p>\r\n\r\n<p>var fruits = [&#39;orange&#39;, &#39;apple&#39;, &#39;squash&#39;, &#39;pear&#39;]; for (var fruit of fruits) { console.log(fruit); }<\/p>\r\n\r\n<p>The beautiful thing about the for..of loop is that we can now finally get the values of an Array for example without needing to write a long convoluted for loop, create a pointer and increment some kind of counter using a variable. It is arguably the cleanest way to get values out of an array.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h3>forEach Loop<\/h3>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>This is an interesting one because even though it is a loop, it can&rsquo;t really be considered a traditional loop because it is somewhat limited in its use.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>The forEach loop also only works with arrays, not objects. It has the added advantage of not requiring additional variables to be defined, thus polluting your scope, just a method.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Probably the most limited of the bunch and in the sense of a loop, probably not really a loop you need to know. Still, I find it useful and it is important you know your options when it comes to iterating over an array of items.<\/p>\r\n\r\n<p>var fruits = [&#39;apple&#39;, &#39;banana&#39;, &#39;orange&#39;, &#39;grapes&#39;, &#39;pear&#39;, &#39;passionfruit&#39;]; \/\/ The three values on the callback function are: \/\/ element - The element being traversed \/\/ index - The current index of the item in the array starting at 0 \/\/ array - The array being traversed (probably mostly irrelevant) fruits.forEach(function(element, index, array) { console.log(index, element); });<\/p>\r\n\r\n<p>Sometimes you just want to simply iterate an array and get its values, modify them like jQuery gives us in the form of jQuery.each.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>The only downside of a forEach is that you cannot break the loop. If you want to create a loop using ES5 syntax, there is Array.every which you can read about using <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Reference\/Global_Objects\/Array\/forEach#Example:_Breaking_a_loop\">here<\/a>.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h3>While Loop<\/h3>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>The while loop is similar to a for loop, except it only accepts one argument and that is a statement that equals true or false. So if you remember earlier we have three conditions for our for loop, this would be condition 2.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>While loops are generally regarded as the fastest form of loop, that is debatable. You cannot argue that they don&rsquo;t look cleaner than other types of loop. And in certain situations they can be the fastest type of loop because they&rsquo;re arguably a lot less complex.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>In my experience the fastest kind of while loop is a decrementing while loop in which you take a value and subtract from it until you hit zero (which is falsey).<\/p>\r\n\r\n<p>var i = 20; while (i--) { console.log(i); }<\/p>\r\n\r\n<h3>Do..while Loop<\/h3>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>You don&rsquo;t see the do..while loop being used all too much in favour of a straight for loop or while. You should know what the do while loop does even if you will never use it.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>A while loop isn&rsquo;t guaranteed to run. Meaning if you supply an expression to your while loop that equals falsey then it will not run. A do..while is guaranteed to run at least once.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>But it doesn&rsquo;t end there. A while loop executes its condition before the loop begins, the do..while executes the condition after the loop runs. Hence why a do..while is guaranteed to run at least once. The loop runs, the expression is checked and then so on.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Once again the Mozilla Developer documentation has an excellent articles on most of the loops touched upon <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Guide\/Loops_and_iteration\">here<\/a>.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>Basic methods &amp; tasks<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>There are basic methods in Javascript you really should be aware of. From working with arrays to strings, Javascript contains a treasure chest of useful methods. We only touch upon methods for working with strings and arrays in this post, not objects or any other kind of value.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>If you want to read more on working with various types of data in Javascript, the Mozilla Developer documentation is a nice and concise site for learning more about various methods.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Obviously some people will have opinions on whether or not you should know all of these and perhaps some I have left out. My memory can only stretch so far, but here are a few I think most developers should know. Knowing how to manipulate strings efficiently is an essential skill in my opinion.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h3>Working with strings<\/h3>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>In Javascript with exception of maybe working with arrays and objects, you will find yourself working with strings probably quite a bit. Even if you don&rsquo;t really work with strings (or you think you don&rsquo;t) knowing these basic methods for working with strings is an invaluable thing to commit to memory.<\/p>\r\n\r\n<p>String.replace(regexp|replaceThis, replaceWith|callback) &ndash; Allows you to replace a value with another value or even use a regular expression. String.concat(&lsquo;string1&rsquo;, &lsquo;string 2&rsquo;, etc&hellip;) &ndash; This method allows you to concatenate one or more string values together. String.indexOf(value) &ndash; This method allows you to find the first occurrence of the specified value, or &ndash;1 if not found. String.slice(startIndex, endIndex) &ndash; This method does what it says. It will take a starting index (from zero) and an ending index value and return a new string with that chunk. String.split(separator, limit) &ndash; This method will split a string into an array comprised of one or more items. String.substr(startIndex, length) &ndash; This method will return the characters in the string starting from the startIndex value and only the specified length. String.toLowerCase &ndash; This method will return the specified calling string value as all lowercase. String.toUpperCase &ndash; This method will return the specified calling string value as all UPPERCASE. String.trim &ndash; Whitespace from the beginning and end of the calling string will be removed.<\/p>\r\n\r\n<h3>Working with arrays<\/h3>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>During day-to-day development, I find myself working with arrays a lot. They serve as a great way to store data, to keep track of states and using them as maps generally.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>I think knowing how to do basic tasks with arrays is an essential skill for a Javascript developer to have. Things you should not have to really Google.<\/p>\r\n\r\n<p>Array.pop &ndash; Removes the last element from an array and returns it Array.shift &ndash; Removes the first element from an array and returns it Array.push(val1, val2&hellip;) &ndash; Add one or more items to the end of an array. This method will always return the new array length after it is run. You can specify multiple comma separated values. Array.reverse &ndash; Reverses the order of an array (the first element becomes the last and the last one becomes the first, etc). Array.sort([compareFunction]) &ndash; Allows you to sort an array by specifying a compare function which has access to each value in the array you can sort on. Array.join(separator) &ndash; This method takes one or more items in the array and returns a string of values joined by their separator. If you don&rsquo;t specify a separator, the default is a comma.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Array.indexOf(value) &ndash; This method allows you to find the first occurrence of the specified value, or &ndash;1 if not found.<\/p>\r\n\r\n<p>There are other methods for working with arrays not listed <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Reference\/Global_Objects\/Array#Methods\">here<\/a> which you should definitely read upon further. There are some exciting new methods that were added in ES6 not listed here and other array methods that go into more specific use cases.<\/p>\r\n\r\n<h2>Difference between Call and Apply<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>These two methods are misunderstood and intimidate a lot of developers. While it is possible to go without using call or apply, they are especially handy because they allow you to call methods and change what the context of the this value is during execution.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>The difference between the two is only subtle, but there is a difference. Using the call method will allow you to provide infinite comma separated arguments when calling a function.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Using the apply method will allow you to call a method using an array as the supplied arguments. The method is great if you want to use an array as arguments on a method call as well as change the context of this.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>If you are just wanting to use an array of values as arguments on a function, ES6 comes to the rescue in the form of a spread operator. It doesn&rsquo;t allow you to change the context of this, but it does allow you to use an array of values as arguments.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>An example using .call<\/strong>:<\/p>\r\n\r\n<p>function myFunc() { console.log(arguments); } myFunc.call(this, 1, 2, 3, 4, 5);<\/p>\r\n\r\n<p><strong>An example using .apply<\/strong>:<\/p>\r\n\r\n<p>function myFunc() { console.log(arguments); } myFunc.apply(this, [1, 2, 3, 4, 5]);<\/p>\r\n\r\n<p>The new additions to ES6 mean there are really limited instances where we will need to use call or apply in the future. Thanks in part to <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Reference\/Operators\/Spread_operator\">spread operators<\/a>, <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Reference\/Functions\/Arrow_functions\">arrow functions<\/a> and the ability since ES5 to use <a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\/Reference\/Global_Objects\/Function\/bind\">bind<\/a>.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>Familiarity with frameworks\/libraries<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>These days the biggest contenders in the Javascript framework race appear to be AngularJS, React.js and Ember. There are of course millions more, but these are the biggest and currently most popular (in my opinion).<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>As web applications grow in complexity, these frameworks and libraries make our lives easier. It is not unreasonable to expect that a Javascript developer in 2015 should know at least one framework or library other than jQuery.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Almost any job listing you look at searching for a front-end\/Javascript developer will most likely mention a framework or two as a requirement or nice-to-have skill. Don&rsquo;t get left behind.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>Node.js<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Without-a-doubt Node.js has proved its worth and shows no signs of falling by the wayside (unless IO.js kills it). Pretty much every front-end tool is built upon it and uses the Node Package Manager (NPM), if you have been holding off learning Node.js, you should reconsider.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Because Node.js is Javascript at its core, the learning curve is non-existent if you already no a little bit of Javascript. You will find you spend more time configuring packages you are using in your apps than you do learning Node.js.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>I personally think Node.js is a skill every developer needs to have in 2015. I am not talking overly complex in-depth knowledge of it, but enough to use it for development servers, prototyping, testing and other use-cases where Node.js will be beneficial to your work-flow.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>There is of course the fork of Node.js called IO.js which at present is exactly the same. At the end of the day, you&rsquo;re just writing Javascript, albeit with a few small differences.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>Testing<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Once upon a time we didn&rsquo;t really test Javascript code, it wasn&rsquo;t something that many thought was necessary because lets face it: things never used to be that pretty or complicated. The language has grown inherently complex thanks in part to front-end frameworks like AngularJS and server side Javascript in the form of Node.js.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>As Javascript evolves and code-bases swell as we use it for more and more things, testing becomes important, if not vital. If you aren&rsquo;t testing your code in 2015, you&rsquo;re doing it wrong.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>My favourite test runner is definitely <a href=\"http:\/\/karma-runner.github.io\/\">Karma<\/a>. There are plenty of others to consider, but Karma is especially great for testing AngularJS applications. And if it&rsquo;s good enough for AngularJS, it is good enough for me.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>Tooling<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Being a Javascript developer in 2015 means knowing how to use task runners, transpilers, profilers and other tools we have at our disposal to write the best Javascript code possible.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Sometimes the tools bundled within our browsers while good don&rsquo;t always accurately depict what is going on inside your application. Sometimes you need to use a dedicated tool to get more detailed information about the inner workings on your application.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Tools to look into (if you don&rsquo;t already use them); Gulp, Webpack and BabelJS. There are a lot of tools out there, task runners like Gulp and even Grunt are particular great additions to a modern Javascript heavy work-flow (if you don&rsquo;t already use them).<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Gone are the days of downloading a single Javascript file and including it into our page. These days package managers like NPM and Bower are used in place of manually downloading scripts.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>We combine and minify scripts using task runners, test using separate tools and things are generally more organised.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Javascript tooling goes hand-in-hand with the likes of writing isomorphic Javascript (shared code-base between the server and front-end).<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>ECMAScript 6 aka ES6 aka ESNext<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Even though browser support still has a while to go before most of the good parts of ECMAScript 6 are supported, we can use transpilers to start writing ES6 code today.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Familiarise yourself with all of the new API&rsquo;s and methods around; strings, arrays and other cool features like WeakMaps, Symbols and Classes. Being a developer in 2015 means staying up-to-date with what is changing within the Javascript language.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Familiarise yourself with the concept of classes especially. They are merely syntactical sugar over the top of prototypical inheritance (for the moment), but there are plans to evolve classes in ES7 and beyond to make them more useful and less sugary.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>Further Reading<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>There are plenty of great resources out there for learning deeper parts of Javascript, many much better and insightful than this post.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><a href=\"http:\/\/youmightnotneedjquery.com\/\">You Might Not Need jQuery<\/a><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><a href=\"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/JavaScript\">Mozilla Developer: Javascript Reference &amp; Guide<\/a><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><a href=\"http:\/\/jstherightway.org\/\">JS: The Right Way<\/a><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><a href=\"https:\/\/github.com\/airbnb\/javascript\">AirBnb&rsquo;s Javascript Styleguide<\/a><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>Conclusion<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>This post is really only scratching the surface. There are plenty more things I could go on about. Evident by how big this post is, there is a lot expected of a modern Javascript developer.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Please do not take this as gospel or the ultimate list of things Javascript developers should know. But having said that, there are certain things that all Javascript developers should know and as such, this article is my personal opinion.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>If you have any improvements or see anything that can be expanded upon or added, please feel free to comment and let me know below.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n",
			"link": "Blog",
			"slika": "boban-welcome1421450429.boban-welcome.jpg",
			"date": "2015-03-12 12:15:51",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "avascript is an ever-growing language, especially now that releases for ECMAScript specifications now operate on a yearly release schedule. As such the importance of needing to know Javascript beyond just jQuery becomes even more important as the language grows in scope and quite quickly."
		}, {
			"id": 63,
			"naslov": "The way we really feel the word ",
			"sadrzaj": "<p>The way we feel and behave is not natural one, but this one, yes it is. Pure way of seeing things is one which we can barely remember.  I just wanted to point out that because of all things we do during the day to day obligations we usually forget to think about life we live. We forget how word is really an interesting and fun place. So this time I just want to make sure we try&nbsp; laughing healthy and pure like this cute kid can. In the name of fun lets start for beginning&nbsp; with laughing :)<\/p>\r\n<p><iframe width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"\" src=\"http:\/\/www.youtube.com\/embed\/RP4abiHdQpc?rel=0\"><\/iframe><\/p>",
			"link": "Blog",
			"slika": "back16.jpg",
			"date": "2013-03-01 10:22:41",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "The way we feel and behave is not natural one, but this one, yes it is. Pure way of seeing things is one which we can barely remember.  I just wanted to point out that because of all things we do during the day to day obligations we usually forget to think about life we live."
		}, {
			"id": 65,
			"naslov": "Tools that might make your day - part One",
			"sadrzaj": "<p>No one can ever have enough useful tools in their toolbox. When it comes to CSS, there are lots of tasks that are either mundane or just error-prone, and definitely could be assisted with little time-saving tools. Especially if you tend to have lots of redesign projects, every now and again you need to explore legacy stylesheets and markup, and also detect unused, duplicate or even erroneous code.<\/p>\r\n<p>PROS: &nbsp;<a target=\"_blank\" href=\"http:\/\/smashingmagazine.us1.list-manage1.com\/track\/click?u=16b832d9ad4b28edf261f34df&amp;id=83af7b85e9&amp;e=2dce279beb\" style=\"font-family: arial, sans-serif; font-size: 14px;\"><span style=\"color: rgb(28, 102, 199);\">ExtractCSS<\/span><\/a><span style=\"color: rgb(80, 80, 80); font-family: arial, sans-serif; font-size: 14px;\">&nbsp;<\/span>(click name to see tool) &nbsp;extracts IDs, classes and inline styles from an HTML document and outputs them as a CSS stylesheet. To clean up the markup mess and generate a list of used classes and IDs, you just have to paste HTML and choose the options you prefer (such as indentation, curly braces, semicolons, etc.).<\/p>\r\n<p>CONS: Unfortunately, you can&quot;t upload multiple HTML files ( at least not yet). &nbsp;<\/p>\r\n<p>I hope you will find it useful ;)&nbsp;<\/p>\r\n<p>Boban Stefanovic | Chicago | UI Specialist&nbsp;<\/p>",
			"link": "Blog",
			"slika": "back7.jpg",
			"date": "2013-09-05 13:32:00",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "No one can ever have enough useful tools in their toolbox. When it comes to CSS, there are lots of tasks that are either mundane or just error-prone, and definitely could be assisted with little time-saving tools. "
		}, {
			"id": 66,
			"naslov": " Tools that might make your day II",
			"sadrzaj": "<p>&nbsp;<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>JSON online validator - Boban&quot;s favorite &quot;the most powerful front-end tool&quot;.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Simple like that, line above explains itself! This tool saved more time to me then any tool made so far.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>This one will really make your day no matter if you are front end or back end developer. We all have experience that things are not showing on the page and we have no clue what is going on specifically during the process of developing or implementation. JSON validator.pngThere were days when developers could not reach other developers and they could not complete tasks (and running out of time) because they got stack with no help coming away. &nbsp;Well, &nbsp;all these problems will be past if we just knew that problem would be caused by wrong structured JSON&hellip; The whole BOOO thing is usually a &nbsp;simple syntax error, maybe simple &ldquo;dot&rdquo; or &ldquo;comma&rdquo; &nbsp;on the wrong place, or missing brackets&hellip; You will agree that we are not talking about making space shuttle and we should not be prevent of doing our job so anytime you see no data populating, first thing to do is to check on your JSON structure and make sure that format is correct.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Here is a tool that I prefer to check JSON structure on mine day to day work. &nbsp;<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>http:\/\/pro.jsonlint.com\/ - pro version<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>http:\/\/jsonlint.com\/ - basic (as in screenshot)<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>https:\/\/github.com\/umbrae\/jsonlintdotcom - on gitHub<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>If you think this article is helpful for you, please give me a like (maybe I get bonus next year :) ) Just kidding about bonus but your like &nbsp;will definitely give me a wings to write more useful things and share them with you. Oh, comments too if you have any.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Thanks!<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Boban Stefanovic | Chicago | UI Specialist&nbsp;<br \/>\r\n&nbsp;<\/p>\r\n\r\n<p>Day to Day Work, Tools and Links, U-Experience U-Interface<\/p>\r\n",
			"link": "Blog",
			"slika": "back3.jpg",
			"date": "2013-09-05 13:33:55",
			"home": "N",
			"promo": 0,
			"eventDate": "2020-06-18 00:00:00",
			"description": "This one will really make your day no matter if you are front end or back end developer. We all have experience that things are not showing on the page and we have no clue what is going on specifically during the process of developing or implementation."
		}, {
			"id": 67,
			"naslov": "Sublime Text Editor ",
			"sadrzaj": "<p><tt>&nbsp;Recently I found a very interesting text editor and came to my mind to share that with people who prefer simple, light  and beautiful application. Similar like Microsoft Code, this editor after all is very useful tool too. Sublime Text ( http:\/\/www.sublimetext.com\/ ) by itself is very simple but aside simplicity has pretty amazing features that we all need sometimes.<\/tt><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>One of my favorite features is &quot;Distraction Free Mode&quot; &ndash; full screen. When you need to focus, Distraction Free Mode is there to help you out. Distraction Free Mode is full screen, chrome free editing, with nothing but your text in the center of the screen. You can incrementally show elements of the UI, such as tabs and the find panel, as you need them.<\/p>\r\n\r\n<p>Second would be &quot;Split Editing&quot;. Really cool, you can grid your screen and have opened multiple files and work on all of them at once. Cool feature &nbsp;for &quot;multitaskers&quot; . Taking advantage of multiple monitors by editing with multiple windows, and using multiple splits in each window is what this feature represents.<\/p>\r\n\r\n<p>The best of all it is supported by all platforms we use in Element Solutions :MAC, WIN and LINUX. Sublime Text uses a custom UI toolkit, optimized for speed and beauty, while taking advantage of native functionality on each platform<\/p>\r\n\r\n<p>Download: http:\/\/www.sublimetext.com\/<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>Boban Stefanovic | Chicago | UI Specialist<\/p>\r\n\r\n<p>Day to Day Work, Tools and Links, User Experience, User Interface, UI,UX<\/p>\r\n",
			"link": "Blog",
			"slika": "back12.jpg",
			"date": "2013-09-05 13:36:22",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "Recently I found a very interesting text editor and came to my mind to share that with people who prefer simple, light  and beautiful application. "
		}, {
			"id": 84,
			"naslov": "GraphQL",
			"sadrzaj": "<h2>Whats GraphQL<\/h2>\r\n<p>GraphQL according to Facebook is not new technology. Its been used by folks from Facebook since 2012. After over a year being open sourced, they brought GraphQL and launched <a href='http:\/\/www.graphql.org' target=_BLANK >graphql.org<\/a>. I personally think this is very cool approach so writting about it. <\/p>\r\n\r\n<p>GraphQL is a query language for your API, and a server-side runtime for executing queries by using a type system user  defines for data. GraphQL isn't tied to any specific database or storage engine and is instead backed by users existing code and data. GraphQL provides a complete description of the data in API. GraphQL makes API easier to evolve, and modify with no impact on original query. <p\/>\r\n\r\n<p>GraphQL makes it easy to build tools by leveraging API’s type system. It allows to evolve API without using versioning. GraphQL can deprecate property without  impacting existing queries. For an example, by simple adding @deprecated,  property will be removed from query:<\/p>\r\n\r\n<code>\r\nType: Company{\r\n\t<p>Employees: Int<p\/>\r\n\t<p>Address: String<\/p>\r\n\t<p>CEO: String<\/p>\r\n\t<p>NumberOfProperties: Int<\/p>\r\n\t<p>OldAddress: String <strong>@deprecated<\/strong> <\/p>\r\n}<\/code>\r\n\r\n<p>GraphQL creates a uniform API across your entire application without being limited by a specific storage engine. Write GraphQL APIs that leverage your existing data and code with GraphQL engines available in many languages. You provide functions for each field in the type system, and GraphQL calls them with optimal concurrency.<\/p>\r\n\r\n<h2>What makes it different from REST API ? <\/h2>\r\n\r\n<p>GraphQL gets many resources in single query. GraphQL queries access not just the properties of one resource but also references between them. While typical REST APIs require loading from multiple URLs, GraphQL APIs get all the data in a single request. <\/p>\r\n",
			"link": "Blog",
			"slika": "back5.jpg",
			"date": "2019-05-16 21:19:06",
			"home": "N",
			"promo": 0,
			"eventDate": "0000-00-00 00:00:00",
			"description": "GraphQL according to Facebook is not new technology. Its been used by folks from Facebook since 2012. After over a year being open sourced, they brought GraphQL and launched ..."
		}]
	}
}